{
  "chart": {
    "title": "Share of electricity production from fossil fuels",
    "citation": "Ember (2025); Energy Institute - Statistical Review of World Energy (2025)",
    "originalChartUrl": "https://ourworldindata.org/grapher/share-electricity-fossil-fuels?v=1&csvType=full&useColumnShortNames=false",
    "selection": [
      "World",
      "China",
      "Australia",
      "United States",
      "South Africa",
      "Sweden",
      "France",
      "India"
    ]
  },
  "columns": {
    "Fossil fuels - % electricity": {
      "titleShort": "Share of electricity generated by fossil fuels",
      "titleLong": "Share of electricity generated by fossil fuels - Ember",
      "descriptionShort": "Electricity generation from coal, oil, and gas, measured as a percentage of total electricity produced in the country or region.",
      "descriptionProcessing": "- While the Energy Institute (EI) provides a longer time series (dating back to 1965) than Ember (dating back only to 1990 for European countries and 2000 for other countries), EI does not cover all countries or all sources of electricity (for example, generation from bioenergy is missing). Therefore, when data from Ember is available for a given country and year, we use it as the primary data source. Where Ember data is unavailable, we supplement it with data from EI.",
      "shortUnit": "%",
      "unit": "%",
      "timespan": "1985-2024",
      "type": "Numeric",
      "owidVariableId": 1077645,
      "shortName": "fossil_share_of_electricity__pct",
      "lastUpdated": "2025-06-27",
      "nextUpdate": "2026-06-27",
      "citationShort": "Ember (2025); Energy Institute - Statistical Review of World Energy (2025) – with major processing by Our World in Data",
      "citationLong": "Ember (2025); Energy Institute - Statistical Review of World Energy (2025) – with major processing by Our World in Data. “Share of electricity generated by fossil fuels – Ember” [dataset]. Ember, “Yearly Electricity Data Europe”; Ember, “Yearly Electricity Data”; Energy Institute, “Statistical Review of World Energy” [original data].",
      "fullMetadata": "https://api.ourworldindata.org/v1/indicators/1077645.metadata.json"
    }
  },
  "dateDownloaded": "2025-08-24",
  "activeFilters": {}
}